# Путь к скачанному XLSX-файлу
XLSX_FILE = "players_2015_2017.xlsx"

# Минимальные рейтинги для включения в базу (хотя бы один должен быть >= порога)
MIN_CLASSIC = 1100
MIN_RAPID = 1100
MIN_BLITZ = 1100
# если не хотим отсеивать, ставим 0

# Коды регионов СЗФО (для будущего анализа)
SZFO_REGIONS = [10, 11, 29, 35, 39, 47, 51, 53, 60, 83, 91, 111, 147]

# ID Алёны
DAUGHTER_ID = 600057

# Даты турниров для вычисления дельты (формат YYYY-MM-DD)
TOURNAMENT_DATES = {
    "rf_26_blitz": "2026-02-03",
    "rf_26_class": "2026-02-06",
    "rf_26_rapid": "2026-02-04",
    "szfo_25_blitz": "2025-12-04",
    "szfo_25_class": "2025-11-24",
    "szfo_25_rapid": "2025-12-03",
}
